In [23]:
import pandas as pd 
df=pd.read_csv("titanic.csv",skipinitialspace=True)
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [24]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [25]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [26]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [27]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [28]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   1  2
0  1  0
1  0  1
2  0  1

In [29]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass  Sex   Age     Fare  1  2
0       3    1  22.0   7.2500  1  0
1       1    2  38.0  71.2833  0  1
2       3    2  26.0   7.9250  0  1

In [30]:
inputs.drop("Sex",axis=1,inplace=True)
inputs.head(3)

   Pclass   Age     Fare  1  2
0       3  22.0   7.2500  1  0
1       1  38.0  71.2833  0  1
2       3  26.0   7.9250  0  1

In [31]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [32]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [34]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  1  2
0       3  22.000000   7.2500  1  0
1       1  38.000000  71.2833  0  1
2       3  26.000000   7.9250  0  1
3       1  35.000000  53.1000  0  1
4       3  35.000000   8.0500  1  0
5       3  29.699118   8.4583  1  0

In [36]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [37]:
len(x_train)

712

In [38]:
len(x_test)

179

In [39]:
len(inputs)

891

In [40]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [42]:
model.fit(x_train,y_train)

GaussianNB()

In [43]:
model.score(x_test,y_test)

0.7541899441340782

In [45]:
y_test[:10]

181    0
732    0
804    1
575    0
384    0
445    1
294    0
612    1
717    1
704    0
Name: Survived, dtype: int64

In [44]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 1, 1, 0], dtype=int64)

In [46]:
model.predict_proba(x_test[:10])

array([[0.98152231, 0.01847769],
       [0.97988236, 0.02011764],
       [0.99128483, 0.00871517],
       [0.99017724, 0.00982276],
       [0.99159245, 0.00840755],
       [0.52814497, 0.47185503],
       [0.99093733, 0.00906267],
       [0.06282495, 0.93717505],
       [0.02778583, 0.97221417],
       [0.99121051, 0.00878949]])